Функция ВсеКорневыеТипы() Экспорт
	
	СоответствиеТипов = Новый ТаблицаЗначений;
	СоответствиеТипов.Колонки.Добавить("Ед");
	СоответствиеТипов.Колонки.Добавить("Мн");
	СоответствиеТипов.Колонки.Добавить("ЕдEng");
	СоответствиеТипов.Колонки.Добавить("МнEng");
	СоответствиеТипов.Колонки.Добавить("console");
	СоответствиеТипов.Колонки.Добавить("consoleL");
	СоответствиеТипов.Колонки.Добавить("ЕстьПредопределенные", Новый ОписаниеТипов("Булево"));
	СоответствиеТипов.Колонки.Добавить("ЕстьОбщийРеквизит", Новый ОписаниеТипов("Булево"));
	СоответствиеТипов.Колонки.Добавить("ЕстьТЧ", Новый ОписаниеТипов("Булево"));
	СоответствиеТипов.Колонки.Добавить("НетВКД3", Новый ОписаниеТипов("Булево"));
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ОбщийМодуль";
	СтрокаТЗ.Мн = "общиемодули";
	СтрокаТЗ.ЕдEng = "CommonModule";
	СтрокаТЗ.МнEng = "CommonModules";
	СтрокаТЗ.console = "commonModules";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ОбщийРеквизит";
	СтрокаТЗ.ЕдEng = "CommonAttribute";
	СтрокаТЗ.МнEng = "CommonAttributes";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ПараметрСеанса";
	СтрокаТЗ.ЕдEng = "SessionParameter";
	СтрокаТЗ.МнEng = "SessionParameters";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Константа";
	СтрокаТЗ.ЕдEng = "Constant";
	СтрокаТЗ.МнEng = "Constants";
	СтрокаТЗ.console = "constants";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ПланОбмена";
	СтрокаТЗ.Мн = "планыобмена";
	СтрокаТЗ.ЕдEng = "ExchangePlan";
	СтрокаТЗ.МнEng = "ExchangePlans";
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "exchangePlans";
	СтрокаТЗ.consoleL = "exchangeplans";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Справочник";
	СтрокаТЗ.Мн = "справочники";
	СтрокаТЗ.ЕдEng = "Catalog";
	СтрокаТЗ.МнEng = "Catalogs";
	СтрокаТЗ.ЕстьПредопределенные = Истина;
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "catalogs";
	СтрокаТЗ.consoleL = "catalogs";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Документ";
	СтрокаТЗ.Мн = "документы";
	СтрокаТЗ.ЕдEng = "Document";
	СтрокаТЗ.МнEng = "Documents";
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "documents";
	СтрокаТЗ.consoleL = "documents";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Перечисление";
	СтрокаТЗ.Мн = "перечисления";
	СтрокаТЗ.ЕдEng = "Enum";
	СтрокаТЗ.МнEng = "Enums";
	СтрокаТЗ.console = "enums";
	СтрокаТЗ.consoleL = "enums";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ПланВидовХарактеристик";
	СтрокаТЗ.Мн = "планывидовхарактеристик";
	СтрокаТЗ.ЕдEng = "ChartOfCharacteristicTypes";
	СтрокаТЗ.МнEng = "ChartsOfCharacteristicTypes";
	СтрокаТЗ.ЕстьПредопределенные = Истина;
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "chartsOfCharacteristicTypes";
	СтрокаТЗ.consoleL = "chartsofcharacteristictypes";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ПланСчетов";
	СтрокаТЗ.Мн = "планысчетов";
	СтрокаТЗ.ЕдEng = "ChartOfAccounts";
	СтрокаТЗ.МнEng = "ChartsOfAccounts";
	СтрокаТЗ.ЕстьПредопределенные = Истина;
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "сhartsOfAccounts";
	СтрокаТЗ.consoleL = "сhartsofaccounts";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ПланВидовРасчета";
	СтрокаТЗ.Мн = "планывидоврасчета";
	СтрокаТЗ.ЕдEng = "ChartOfCalculationTypes";
	СтрокаТЗ.МнEng = "ChartsOfCalculationTypes";
	СтрокаТЗ.ЕстьПредопределенные = Истина;
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "chartsOfCalculationTypes";
	СтрокаТЗ.consoleL = "chartsofcalculationtypes";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "РегистрСведений";
	СтрокаТЗ.Мн = "регистрысведений";
	СтрокаТЗ.ЕдEng = "InformationRegister";
	СтрокаТЗ.МнEng = "InformationRegisters";
	СтрокаТЗ.console = "infoRegs";
	СтрокаТЗ.consoleL = "inforegs";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "РегистрНакопления";
	СтрокаТЗ.Мн = "регистрынакопления";
	СтрокаТЗ.ЕдEng = "AccumulationRegister";
	СтрокаТЗ.МнEng = "AccumulationRegisters";
	СтрокаТЗ.console = "accumRegs";
	СтрокаТЗ.consoleL = "accumregs";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "РегистрБухгалтерии";
	СтрокаТЗ.Мн = "регистрыбухгалтерии";
	СтрокаТЗ.ЕдEng = "AccountingRegister";
	СтрокаТЗ.МнEng = "AccountingRegisters";
	СтрокаТЗ.console = "accountRegs";
	СтрокаТЗ.consoleL = "accountregs";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "РегистрРасчета";
	СтрокаТЗ.Мн = "регистрырасчета";
	СтрокаТЗ.ЕдEng = "CalculationRegister";
	СтрокаТЗ.МнEng = "CalculationRegisters";
	СтрокаТЗ.console = "calcRegs";
	СтрокаТЗ.consoleL = "calcregs";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "БизнесПроцесс";
	СтрокаТЗ.Мн = "бизнеспроцессы";
	СтрокаТЗ.ЕдEng = "BusinessProcess";
	СтрокаТЗ.МнEng = "BusinessProcesses";
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "businessProcesses";
	СтрокаТЗ.consoleL = "businessprocesses";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Задача";
	СтрокаТЗ.Мн = "задачи";
	СтрокаТЗ.ЕдEng = "Task";
	СтрокаТЗ.МнEng = "Tasks";
	СтрокаТЗ.ЕстьОбщийРеквизит = Истина;
	СтрокаТЗ.ЕстьТЧ = Истина;
	СтрокаТЗ.console = "tasks";
	СтрокаТЗ.consoleL = "tasks";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Обработка";
	СтрокаТЗ.Мн = "обработки";
	СтрокаТЗ.ЕдEng = "DataProcessor";
	СтрокаТЗ.МнEng = "DataProcessors";
	СтрокаТЗ.console = "dataProc";
	СтрокаТЗ.НетВКД3 = Истина;
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Отчет";
	СтрокаТЗ.Мн = "отчеты";
	СтрокаТЗ.ЕдEng = "Report";
	СтрокаТЗ.МнEng = "Reports";
	СтрокаТЗ.console = "reports";
	СтрокаТЗ.НетВКД3 = Истина;
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ОбщийМакет";
	СтрокаТЗ.Мн = "общиемакеты";
	СтрокаТЗ.ЕдEng = "CommonTemplate";
	СтрокаТЗ.МнEng = "CommonTemplates";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "Макет";
	СтрокаТЗ.Мн = "макеты";
	СтрокаТЗ.ЕдEng = "Template";
	СтрокаТЗ.МнEng = "Templates";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ЖурналДокументов";
	СтрокаТЗ.Мн = "журналыдокументов";
	СтрокаТЗ.ЕдEng = "DocumentJournal";
	СтрокаТЗ.МнEng = "DocumentJournals";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "РегламентноеЗадание";
	СтрокаТЗ.Мн = "регламентныезадания";
	СтрокаТЗ.ЕдEng = "ScheduledJob";
	СтрокаТЗ.МнEng = "ScheduledJobs";
	
	СтрокаТЗ = СоответствиеТипов.Добавить();
	СтрокаТЗ.Ед = "ОпределяемыйТип";
	СтрокаТЗ.ЕдEng = "DefinedType";
	СтрокаТЗ.МнEng = "DefinedTypes";
	
	Возврат СоответствиеТипов;
	
КонецФункции

Функция ВсеТипыСвойствXML() Экспорт
	
	ВсеТипыСвойств = Новый Соответствие;
	
	//ВсеТипыСвойств.Вставить("BusinessProcessRoutePointRef", "");
	ВсеТипыСвойств.Вставить("BusinessProcessRef", "businessProcesses");
	ВсеТипыСвойств.Вставить("CatalogRef", "catalogs");
	ВсеТипыСвойств.Вставить("ChartOfAccountsRef", "сhartsOfAccounts");
	ВсеТипыСвойств.Вставить("ChartOfCalculationTypesRef", "chartsOfCalculationTypes");
	ВсеТипыСвойств.Вставить("ChartOfCharacteristicTypesRef", "chartsOfCharacteristicTypes");
	ВсеТипыСвойств.Вставить("DocumentRef", "documents");
	ВсеТипыСвойств.Вставить("EnumRef", "enums");
	ВсеТипыСвойств.Вставить("ExchangePlanRef", "exchangePlans");
	ВсеТипыСвойств.Вставить("TaskRef", "tasks");
	//ВсеТипыСвойств.Вставить("cfg:BusinessProcessRoutePointRef", "");
	ВсеТипыСвойств.Вставить("cfg:BusinessProcessRef", "businessProcesses");
	ВсеТипыСвойств.Вставить("cfg:CatalogRef", "catalogs");
	ВсеТипыСвойств.Вставить("cfg:ChartOfAccountsRef", "сhartsOfAccounts");
	ВсеТипыСвойств.Вставить("cfg:ChartOfCalculationTypesRef", "chartsOfCalculationTypes");
	ВсеТипыСвойств.Вставить("cfg:ChartOfCharacteristicTypesRef", "chartsOfCharacteristicTypes");
	ВсеТипыСвойств.Вставить("cfg:DocumentRef", "documents");
	ВсеТипыСвойств.Вставить("cfg:EnumRef", "enums");
	ВсеТипыСвойств.Вставить("cfg:ExchangePlanRef", "exchangePlans");
	ВсеТипыСвойств.Вставить("cfg:TaskRef", "tasks");
	
	Возврат ВсеТипыСвойств;
	
КонецФункции

Функция КорневойТипРегистра(КорневойТип) Экспорт
	
	Возврат КорневойТип = "регистрысведений" ИЛИ КорневойТип = "регистрынакопления"
		 ИЛИ КорневойТип = "регистрыбухгалтерии" ИЛИ КорневойТип = "регистрырасчета";
	
КонецФункции
